ktx이음중부내륙= ['부발(이천)','가남','감곡장호원','앙성온천', '충주' ]

kxt이음중앙선 = ['청량리','양평','서원주','원주','제천','단양','풍기','영주','안동']

ktx이음강릉선 = ['서울','청량리','상봉','양평','만종','평창','진부','정동진','강릉','정동','진동해']

srt호남선 = ['수서','동탄','지제','천안아산','오송','공주','익산','정읍','광주송정','나주','목포']

srt경부선 = ['수서','동탄','지제','천안아산','오송','대전','김천(구미)','동대구','신경주','울산','부산']

itx새마을경부선= ['서울', '영등포', '수원', '평택', '천안', '조치원', '대전', '영동', '김천', '구미', '왜관', '대구', '동대구', '경산', '청도', '밀양', '물금', '구포', '부산']

itx새마을동해선= ['서울', '영등포', '수원', '평택', '천안', '조치원', '대전', '영동', '김천', '구미', '대구', '동대구', '경산', '밀양', '구포', '부전', '신해운대']

itx새마을경전선= ['서울', '영등포', '수원', '평택', '천안', '조치원', '대전', '김천', '구미', '왜관', '대구', '동대구', '경산', '청도', '밀양', '진영', '창원중앙', '창원', '마산', '함안', '진주']

itx새마을호남선= ['용산', '영등포', '수원', '평택', '천안', '조치원', '서대전', '계룡', '논산', '강경', '익산', '김제', '신태인', '정읍', '장성', '광주송정', '나주', '함평', '일로', '목포']

itx새마을광주선= ['용산', '영등포', '수원', '평택', '천안', '조치원', '서대전', '계룡', '논산', '강경', '익산', '김제', '신태인', '정읍', '장성', '광주']

itx새마을전라선= ['용산', '영등포', '수원', '평택', '천안', '서대전', '계룡', '논산', '강경', '익산', '전주', '남원', '곡성', '구례구', '순천', '여천', '여수엑스포']

itx청춘= ['춘천 ', ' 남춘천', '강촌', '가평', '청평', '마석', '평내호평', '사릉', '퇴계원', '상봉', '청량리', '왕십리', '옥수', '용산 ']

무궁화경부선= ['서울', '용산', '영등포', '안양', '수원', '오산', '서정리', '평택', '성환', '천안', '전의', '조치원', '부강', '신탄진', '대전', '옥천', '이원', '지탄', '심천', '각계', '영동', '황간', '추풍령', '김천', '구미', '약목', '왜관', '신동', '대구', '동대구', '경산', '남성현', '청도', '상동', '밀양', '삼랑진', '원동', '물금', '화명', '구포', '사상', '부산 ']

무궁화호남선= ['서대전', '계룡', '연산', '논산', '강경', '함열', '익산', '김제', '신태인', '정읍', '백양사', '장성', '광주송정', '나주', '다시', '함평', '무안', '몽탄', '일로', '임성리', '목포 ']

무궁화중앙선= ['청량리', '덕소', '양평', '용문', '지평', '석불', '일신', '매곡', '양동', '삼산', '서원주', '원주', '봉양', '제천', '단양', '풍기', '영주', '안동', '의성', '탑리', '화본', '신녕', '북영천', '영천', '아화', '신경주']

무궁화전라선= ['익산', '삼례', '전주', '임실', '오수', '남원', '곡성', '구례구', '순천', '여천', '여수엑스포']

무궁화충북선= ['동대구', '대전', '신탄진', '조치원', '오송', '청주', '오근장', '청주공항', '증평', '음성', '주덕', '충주', '삼탄', '봉양', '제천', '영주']

무궁화경전선= ['삼랑진', '한림정', '진영', '진례', '창원중앙', '창원', '마산', '중리', '함안', '군북', '반성', '진주', '완사', '북천', '횡천', '하동', '진상', '광양', '순천', '벌교', '조성', '예당', '득량', '보성', '명봉', '이양', '능주', '효천', '서광주', '광주송정']

무궁화영동선= ['영주', '봉화', '춘양', '임기', '현동', '분천', '양원', '승부', '석포', '철암', '동백산', '도계', '신기', '동해']

무궁화태백선= ['제천', '영월', '예미', '민둥산', '사북', '고한', '태백', '동백산']

무궁화장항선= ['천안', '아산', '온양온천', '도고온천', '신례원', '예산', '삽교', '홍성', '광천', '청소', '대천', '웅천', '판교', '서천', '장항', '군산', '대야', '익산']

무궁화동해선= ['부전', '센텀', '신해운대', '기장', '태화강', '북울산', '신경주', '서경주', '안강', '포항', '월포', '장사', '강구', '영덕']

무궁화경북선= ['김천', '옥산', '청리', '상주', '함창', '점촌', '용궁', '개포', '예천', '영주']

무궁화광주선= ['광주송정', '극락강', '영천']

무궁화대구선=['동대구', '하양', '영천']

누리로중앙선 = ['청량리', '덕소', '양평', '용문', '지평', '석불', '일신', '매곡', '양동', '삼산', '서원주', '원주', '봉양', '제천', '단양', '풍기', '영주', '안동']

누리로영동선 = ['영주', '봉화', '춘양', '임기', '현동','분천', '양원', '승부', '석포', '철암', '동백산', '도계', '동해']

누리로영동선셔틀 = ['동해', '묵호', '정동진', '강릉']

동해산타열차= ['강릉', '정동진', '묵호', '동해', '신기', '도계', '동백산', '철암', '석포', '승부', '양원', '비동', '분천']

ktx호남선=['용산', '영등포', '광명', '천안아산', '오송', '서대전', '계룡', '논산', '익산', '김제', '정읍', '장성', '광주', '광주송정', '나주', '목포']


ktx전라선=['용산', '광명', '천안아산', '서대전', '계룡', '논산', '익산', '전주', '남원', '곡성', '구례구', '순천', '여천', '여수엑스포']


ktx경전선=['서울', '광명', '천안아산', '오송', '대전', '김천(구미)', '동대구', '밀양', '진영', '창원중앙', '창원', '마산']



ktx경부선=['행신', '서울', '영등포', '광명', '수원', '천안아산(온양온천)', '오송', '대전', '김천(구미)', '동대구', '신경주', '포항', '밀양', '울산', '구포', '부산']

go = input('출발역을 어디로 설정할까요?')
#go = '행신'
arrival = input('도착역을 어디로 설정하시겠습니까?')
#arrival = '부산'

a = 0


 



if go and arrival in ktx이음중부내륙 :
    print('ktx 중부내륙선') 
    a = 1


if go and arrival in kxt이음중앙선 :
    print('ktx 경부선') 
    a = 1


if go and arrival in ktx이음강릉선 :
    print('ktx이음강릉선') 
    a = 1

if go and arrival in srt호남선 :
    print('srt호남선') 
    a = 1

if go and arrival in srt경부선 :
    print('srt경부선') 
    a = 1

if go and arrival in itx새마을경부선 :
    print('itx새마을경부선') 
    a = 1

if go and arrival in itx새마을동해선 :
    print('itx새마을동해선')
    a = 1

if go and arrival in itx새마을경전선 :
    print('itx새마을경전선')
    a = 1  

if go and arrival in itx새마을호남선 :
    print('itx새마을호남선') 
    a = 1

if go and arrival in itx새마을광주선 :
    print('itx새마을광주선') 
    a = 1

if go and arrival in itx새마을전라선 :
    print('itx새마을전라선') 
    a = 1

if go and arrival in itx청춘 :
    print('itx청춘') 
    a = 1

if go and arrival in 무궁화경부선 :
    print('무궁화경부선') 
    a = 1

if go and arrival in 무궁화호남선 :
    print('무궁화호남선') 
    a = 1


if go and arrival in 무궁화중앙선 :
    print('무궁화중앙선') 
    a = 1


if go and arrival in 무궁화전라선 :
    print('무궁화전라선') 
    a = 1

if go and arrival in 무궁화충북선 :
    print('무궁화충북선') 
    a = 1


if go and arrival in 무궁화경전선 :
    print('무궁화경전선') 
    a = 1


if go and arrival in 무궁화영동선 :
    print('무궁화영동선') 
    a = 1


if go and arrival in 무궁화태백선 :
    print('무궁화태백선') 
    a = 1


if go and arrival in 무궁화장항선 :
    print('무궁화장항선')
    a = 1


if go and arrival in 무궁화동해선 :
    print('무궁화동해선')
    a = 1


if go and arrival in 무궁화경북선 :
    print('무궁호경북선') 
    a = 1


if go and arrival in 무궁화광주선 :
    print('무궁화광주선')
    a = 1

    
if go and arrival in 무궁화대구선:
    print('무궁화대구선')
    a = 1


if go and arrival in 누리로중앙선 :
    print('누리로중앙선')
    a = 1


if go and arrival in 누리로영동선 :
    print('누리로영동선')
    a = 1

if go and arrival in 누리로영동선셔틀 :
   print('누리로영동선셔틀') 
   a = 1


if go and arrival in 동해산타열차 :
    print('동해산타열차') 
    a = 1


if go and arrival in ktx호남선 :
    print('ktx호남선')
    a = 1


if go and arrival in ktx전라선 :
    print('ktx전라선') 
    a = 1


if go and arrival in ktx경전선 :
    print('ktx경전선')
    a = 1


if go and arrival in ktx경부선 :
    print('ktx경부선') 
    a = 1

# if a == 0:
#     print('입력하신 역으로 가는 열차 또는 역이 없습니다 다음은 그 역에 정차하는 열차입니다')
#     if go or arrival in ktx이음중부내륙 :
#       print('ktx 중부내륙선') 
  

#     if go or arrival in kxt이음중앙선 :
#       print('ktx 경부선') 
  

#     if go or arrival in ktx이음강릉선 :
#      print('ktx이음강릉선') 


#     if go or arrival in srt호남선 :
#      print('srt호남선') 
  

#     if go or arrival in srt경부선 :
#      print('srt경부선') 
 

#     if go or arrival in itx새마을경부선 :
#       print('itx새마을경부선') 


#     if go or arrival in itx새마을동해선 :
#      print('itx새마을동해선')


#     if go or arrival in itx새마을경전선 :
#      print('itx새마을경전선')
 

#     if go or arrival in itx새마을호남선 :
#      print('itx새마을호남선') 


#     if go or arrival in itx새마을광주선 :
#      print('itx새마을광주선') 


#     if go or arrival in itx새마을전라선 :
#      print('itx새마을전라선') 


#     if go or arrival in itx청춘 :
#      print('itx청춘') 


#     if go or arrival in 무궁화경부선 :
#      print('무궁화경부선') 


#     if go or arrival in 무궁화호남선 :
#      print('무궁화호남선') 



#     if go or arrival in 무궁화중앙선 :
#      print('무궁화중앙선') 



#     if go or arrival in 무궁화전라선 :
#      print('무궁화전라선') 


#     if go or arrival in 무궁화충북선 :
#      print('무궁화충북선') 
  


#     if go or arrival in 무궁화경전선 :
#      print('무궁화경전선') 



#     if go or arrival in 무궁화영동선 :
#      print('무궁화영동선') 



#     if go or arrival in 무궁화태백선 :
#      print('무궁화태백선') 



#     if go or arrival in 무궁화장항선 :
#      print('무궁화장항선')



#     if go or arrival in 무궁화동해선 :
#      print('무궁화동해선')



#     if go or arrival in 무궁화경북선 :
#      print('무궁호경북선') 



#     if go or arrival in 무궁화광주선 :
#      print('무궁화광주선')
 

    
#     if go or arrival in 무궁화대구선:
#      print('무궁화대구선')
  


#     if go or arrival in 누리로중앙선 :
#      print('누리로중앙선')
    


#     if go or arrival in 누리로영동선 :
#      print('누리로영동선')
    


#     if go or arrival in 누리로영동선셔틀 :
#      print('누리로영동선셔틀') 
    


#     if go or arrival in 동해산타열차 :
#      print('동해산타열차') 
   


#     if go or arrival in ktx호남선 :
#      print('ktx호남선')
    


#     if go or arrival in ktx전라선 :
#      print('ktx전라선') 
    


#     if go or arrival in ktx경전선 :
#      print('ktx경전선')
  


#     if go or arrival in ktx경부선 :
#      print('ktx경부선') 
    


 

 


 
 
 
 

 
 





